{
  "main": {
    "intro": "Hi, I'm Elle",
    "name": "Elleanna Dwyer",
    "description": "Philadelphia based React Developer, currently employed at Printfly Co. where I specialize in Front-End programming across a range of internal applications",
    "image": "profilepic.png",
    "bio": "With a bit of an unconventional background in programming, I believe my experience exemplifies my ability to learn quickly and highlights a certain technological savvy. Beginning with my apprenticeship, I have over 6 years of experience in the development field, with the last two years focusing on React.js. I thoroughly enjoy being around people and working on a team. I believe some of the most important lessons I have learned throughout my experience has derived from collaborative efforts. Outside of work you can catch me crackin mad jokes.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "elleannadwyer@gmail.com",
    "phone": "609-703-9118",
    "github": "https://github.com/elleyanna",
    "address": {
      "street": "224 Greenwich Street",
      "city": "Philadelphia",
      "state": "PA",
      "zip": "19147"
    },
    "website": "elleanna.technology",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/elleanna-dwyer-24619342/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/elleyanna",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "Rutgers University - New Brunswick",
        "degree": "Communication Major",
        "graduated": "May 2012",
        "description": "Studied the theory of effective communication and how it applies to media, technology, and general interpersonal interactions. Coursework included material heavily prevelant in fields such as Public Relations, Advertising, Computer Science, and Journalism."
      }
    ],
    "work": [
      {
        "company": "Tonic Design Co.",
        "title": "Development Apprentice / Quality Assurance",
        "years": "March 2014 - September 2015",
        "description": "Facilitated the development and implication of quality standards across a range of application projects for iOs, Android, and Web via user testing. Shadowed mid and senior-level developers to foster my programming skills and assist in any way needed."
      },
      {
        "company": "Tonic Design Co.",
        "title": "Developer",
        "years": "September 2015 - May 2018",
        "description": "Participated in the design and development of various web applications ranging from internal projects to big client operations with a heavy focus on clean code and user-friendly design. Provided mentorship for students in our apprenticeship program. Engaged and helped organize multiple outside-of-work events that focused on the education of programming specifically as it applies to women in tech."
      },
      {
        "company": "Printfly Co.",
        "title": "React Developer",
        "years": "May 2018 - Current",
        "description": "Began my journey as a React Developer by working with an amazing team to design and develop websites from the ground up for a variety of internal facing applications. Specifically, web apps being used by our Sales Team and our Production Team to help improve business practices and the efficiency of every day operations."
      }
    ],
    "skills": [
      {
        "name": "React",
        "level": "80%"
      },
      {
        "name": "Javascript / es6",
        "level": "80%"
      },
      {
        "name": "GraphQL",
        "level": "70%"
      },
      {
        "name": "HTML / HTML5",
        "level": "85%"
      },
      {
        "name": "CSS",
        "level": "85%"
      },
      {
        "name": "Flexbox",
        "level": "90%"
      },
      {
        "name": "Material Design",
        "level": "90%"
      },
      {
        "name": "Git",
        "level": "85%"
      },
      {
        "name": "Quality Assurance",
        "level": "90%"
      },
      {
        "name": "Communication / Working with a team",
        "level": "95%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Weird Reddit",
        "category": "A feed of some of my favorite weird subreddits, built with React and using Hooks for state management.",
        "image": "renAndStimpy.jpg",
        "url": "https://weird-reddit.elleanna.technology/"
      }
    ]
  }
}